W6D5/Cats/app/controllers/cats_controller.rb

    def show
        @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" IS NULL LIMIT $1  [["LIMIT", 1]]