W6D4/first_routes_and_controllers/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        # debugger
        # artwork = Artwork.find_by(params[:user_id])
        user = User.find_by(id: params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
    def show
        begin
            artwork = Artwork.find(params[:id])