W6D4/first_routes_and_controllers/app/controllers/artworkshares_controller.rb

SELECT "art_work_shares".* FROM "art_work_shares"
---
    def index
        render json: ArtWorkShare.all

SELECT  "art_work_shares".* FROM "art_work_shares" WHERE "art_work_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        begin
            artwork = ArtWorkShare.find(params[:id])

INSERT INTO "art_work_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 1], ["created_at", "2021-04-22 22:06:05.715373"], ["updated_at", "2021-04-22 22:06:05.715373"]]
---
    def create
        artwork = ArtWorkShare.new(artwork_params)
        if artwork.save

SELECT  "art_work_shares".* FROM "art_work_shares" WHERE "art_work_shares"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def update
        begin
            artwork = ArtWorkShare.find(params[:id])

DELETE FROM "art_work_shares" WHERE "art_work_shares"."id" = $1  [["id", 4]]
---
    def destroy
        begin
            artwork = ArtWorkShare.destroy(params[:id])