W6D4/first_routes_and_controllers/app/controllers/comments_controller.rb

    def create
        comment = Comment.new(comment_param)
        if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 8], ["artwork_id", 9], ["body", "banana"], ["created_at", "2021-04-22 23:42:56.228045"], ["updated_at", "2021-04-22 23:42:56.228045"]]

    def index
        comments = Comment.all
        user = User.find_by(id: params[:user_id])
        artwork = Artwork.find_by(id: params[:artwork_id])
---
SELECT "comments".* FROM "comments"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" IS NULL LIMIT $1  [["LIMIT", 1]]

    def destroy
        begin
            comment = Comment.destroy(params[:id]) #find_by => nil, find => relation
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 5]]