W6D4/first_routes_and_controllers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Linda"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index

        if params[:name]
            user = User.find_by(username: params[:name])
            render json: user
        else
            render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def show
        begin
            user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "ryan@gmail.com"], ["name", "Ryan"], ["updated_at", "2021-04-21 23:28:53.082055"], ["id", 2]]
---
    def update
        begin
            user = User.find(params[:id])
            user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
    def destroy
        begin
            user = User.destroy(params[:id])